jharoian-mchp/volt2deg/mcc-project/My_MCC_Config/src/packs/PIC32CM3204GV00064_DFP/pio/pic32cm3204gv00064.h
#define PIN_PB15C_SERCOM4_PAD3                     _UINT32_(47)
#define MUX_PB15C_SERCOM4_PAD3                     _UINT32_(2) 
#define PINMUX_PB15C_SERCOM4_PAD3                  ((PIN_PB15C_SERCOM4_PAD3 << 16) | MUX_PB15C_SERCOM4_PAD3)
#define PORT_PB15C_SERCOM4_PAD3                    (_UINT32_(1) << 15)

/* ================= PORT definition for SERCOM5 peripheral ================= */
#define PIN_PA22D_SERCOM5_PAD0                     _UINT32_(22)
#define MUX_PA22D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PA22D_SERCOM5_PAD0                  ((PIN_PA22D_SERCOM5_PAD0 << 16) | MUX_PA22D_SERCOM5_PAD0)
#define PORT_PA22D_SERCOM5_PAD0                    (_UINT32_(1) << 22)

#define PIN_PB02D_SERCOM5_PAD0                     _UINT32_(34)
#define MUX_PB02D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PB02D_SERCOM5_PAD0                  ((PIN_PB02D_SERCOM5_PAD0 << 16) | MUX_PB02D_SERCOM5_PAD0)
#define PORT_PB02D_SERCOM5_PAD0                    (_UINT32_(1) << 2)

#define PIN_PB30D_SERCOM5_PAD0                     _UINT32_(62)
#define MUX_PB30D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PB30D_SERCOM5_PAD0                  ((PIN_PB30D_SERCOM5_PAD0 << 16) | MUX_PB30D_SERCOM5_PAD0)
#define PORT_PB30D_SERCOM5_PAD0                    (_UINT32_(1) << 30)

#define PIN_PB16C_SERCOM5_PAD0                     _UINT32_(48)
#define MUX_PB16C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PB16C_SERCOM5_PAD0                  ((PIN_PB16C_SERCOM5_PAD0 << 16) | MUX_PB16C_SERCOM5_PAD0)
#define PORT_PB16C_SERCOM5_PAD0                    (_UINT32_(1) << 16)

#define PIN_PA23D_SERCOM5_PAD1                     _UINT32_(23)
#define MUX_PA23D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PA23D_SERCOM5_PAD1                  ((PIN_PA23D_SERCOM5_PAD1 << 16) | MUX_PA23D_SERCOM5_PAD1)
#define PORT_PA23D_SERCOM5_PAD1                    (_UINT32_(1) << 23)

#define PIN_PB03D_SERCOM5_PAD1                     _UINT32_(35)
#define MUX_PB03D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PB03D_SERCOM5_PAD1                  ((PIN_PB03D_SERCOM5_PAD1 << 16) | MUX_PB03D_SERCOM5_PAD1)
#define PORT_PB03D_SERCOM5_PAD1                    (_UINT32_(1) << 3)

#define PIN_PB31D_SERCOM5_PAD1                     _UINT32_(63)
#define MUX_PB31D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PB31D_SERCOM5_PAD1                  ((PIN_PB31D_SERCOM5_PAD1 << 16) | MUX_PB31D_SERCOM5_PAD1)
#define PORT_PB31D_SERCOM5_PAD1                    (_UINT32_(1) << 31)

#define PIN_PB17C_SERCOM5_PAD1                     _UINT32_(49)
#define MUX_PB17C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PB17C_SERCOM5_PAD1                  ((PIN_PB17C_SERCOM5_PAD1 << 16) | MUX_PB17C_SERCOM5_PAD1)
#define PORT_PB17C_SERCOM5_PAD1                    (_UINT32_(1) << 17)

#define PIN_PA24D_SERCOM5_PAD2                     _UINT32_(24)
#define MUX_PA24D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PA24D_SERCOM5_PAD2                  ((PIN_PA24D_SERCOM5_PAD2 << 16) | MUX_PA24D_SERCOM5_PAD2)
#define PORT_PA24D_SERCOM5_PAD2                    (_UINT32_(1) << 24)

#define PIN_PB00D_SERCOM5_PAD2                     _UINT32_(32)
#define MUX_PB00D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PB00D_SERCOM5_PAD2                  ((PIN_PB00D_SERCOM5_PAD2 << 16) | MUX_PB00D_SERCOM5_PAD2)
#define PORT_PB00D_SERCOM5_PAD2                    (_UINT32_(1) << 0)

#define PIN_PB22D_SERCOM5_PAD2                     _UINT32_(54)
#define MUX_PB22D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PB22D_SERCOM5_PAD2                  ((PIN_PB22D_SERCOM5_PAD2 << 16) | MUX_PB22D_SERCOM5_PAD2)
#define PORT_PB22D_SERCOM5_PAD2                    (_UINT32_(1) << 22)

#define PIN_PA20C_SERCOM5_PAD2                     _UINT32_(20)
#define MUX_PA20C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PA20C_SERCOM5_PAD2                  ((PIN_PA20C_SERCOM5_PAD2 << 16) | MUX_PA20C_SERCOM5_PAD2)
#define PORT_PA20C_SERCOM5_PAD2                    (_UINT32_(1) << 20)

#define PIN_PA25D_SERCOM5_PAD3                     _UINT32_(25)
#define MUX_PA25D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA25D_SERCOM5_PAD3                  ((PIN_PA25D_SERCOM5_PAD3 << 16) | MUX_PA25D_SERCOM5_PAD3)
#define PORT_PA25D_SERCOM5_PAD3                    (_UINT32_(1) << 25)

#define PIN_PB01D_SERCOM5_PAD3                     _UINT32_(33)
#define MUX_PB01D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PB01D_SERCOM5_PAD3                  ((PIN_PB01D_SERCOM5_PAD3 << 16) | MUX_PB01D_SERCOM5_PAD3)
#define PORT_PB01D_SERCOM5_PAD3                    (_UINT32_(1) << 1)

#define PIN_PB23D_SERCOM5_PAD3                     _UINT32_(55)
#define MUX_PB23D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PB23D_SERCOM5_PAD3                  ((PIN_PB23D_SERCOM5_PAD3 << 16) | MUX_PB23D_SERCOM5_PAD3)
#define PORT_PB23D_SERCOM5_PAD3                    (_UINT32_(1) << 23)

#define PIN_PA21C_SERCOM5_PAD3                     _UINT32_(21)
#define MUX_PA21C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PA21C_SERCOM5_PAD3                  ((PIN_PA21C_SERCOM5_PAD3 << 16) | MUX_PA21C_SERCOM5_PAD3)
#define PORT_PA21C_SERCOM5_PAD3                    (_UINT32_(1) << 21)

/* =================== PORT definition for TC0 peripheral =================== */
#define PIN_PA04F_TC0_WO0                          _UINT32_(4) 
#define MUX_PA04F_TC0_WO0                          _UINT32_(5) 
#define PINMUX_PA04F_TC0_WO0                       ((PIN_PA04F_TC0_WO0 << 16) | MUX_PA04F_TC0_WO0)
#define PORT_PA04F_TC0_WO0                         (_UINT32_(1) << 4)

#define PIN_PB30F_TC0_WO0                          _UINT32_(62)
#define MUX_PB30F_TC0_WO0                          _UINT32_(5) 
#define PINMUX_PB30F_TC0_WO0                       ((PIN_PB30F_TC0_WO0 << 16) | MUX_PB30F_TC0_WO0)
#define PORT_PB30F_TC0_WO0                         (_UINT32_(1) << 30)

#define PIN_PA08E_TC0_WO0                          _UINT32_(8) 
#define MUX_PA08E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA08E_TC0_WO0                       ((PIN_PA08E_TC0_WO0 << 16) | MUX_PA08E_TC0_WO0)
#define PORT_PA08E_TC0_WO0                         (_UINT32_(1) << 8)

#define PIN_PA05F_TC0_WO1                          _UINT32_(5) 
#define MUX_PA05F_TC0_WO1                          _UINT32_(5) 
#define PINMUX_PA05F_TC0_WO1                       ((PIN_PA05F_TC0_WO1 << 16) | MUX_PA05F_TC0_WO1)
#define PORT_PA05F_TC0_WO1                         (_UINT32_(1) << 5)

#define PIN_PB31F_TC0_WO1                          _UINT32_(63)
#define MUX_PB31F_TC0_WO1                          _UINT32_(5) 
#define PINMUX_PB31F_TC0_WO1                       ((PIN_PB31F_TC0_WO1 << 16) | MUX_PB31F_TC0_WO1)
#define PORT_PB31F_TC0_WO1                         (_UINT32_(1) << 31)

