jharoian-mchp/volt2deg/mcc-project/My_MCC_Config/src/packs/PIC32CM3204GV00064_DFP/pio/pic32cm3204gv00064.h
#define PIN_PB12E_TC4_WO0                          _UINT32_(44)
#define MUX_PB12E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PB12E_TC4_WO0                       ((PIN_PB12E_TC4_WO0 << 16) | MUX_PB12E_TC4_WO0)
#define PORT_PB12E_TC4_WO0                         (_UINT32_(1) << 12)

#define PIN_PA23F_TC4_WO1                          _UINT32_(23)
#define MUX_PA23F_TC4_WO1                          _UINT32_(5) 
#define PINMUX_PA23F_TC4_WO1                       ((PIN_PA23F_TC4_WO1 << 16) | MUX_PA23F_TC4_WO1)
#define PORT_PA23F_TC4_WO1                         (_UINT32_(1) << 23)

#define PIN_PB09F_TC4_WO1                          _UINT32_(41)
#define MUX_PB09F_TC4_WO1                          _UINT32_(5) 
#define PINMUX_PB09F_TC4_WO1                       ((PIN_PB09F_TC4_WO1 << 16) | MUX_PB09F_TC4_WO1)
#define PORT_PB09F_TC4_WO1                         (_UINT32_(1) << 9)

#define PIN_PB13E_TC4_WO1                          _UINT32_(45)
#define MUX_PB13E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PB13E_TC4_WO1                       ((PIN_PB13E_TC4_WO1 << 16) | MUX_PB13E_TC4_WO1)
#define PORT_PB13E_TC4_WO1                         (_UINT32_(1) << 13)

/* =================== PORT definition for TC5 peripheral =================== */
#define PIN_PA24F_TC5_WO0                          _UINT32_(24)
#define MUX_PA24F_TC5_WO0                          _UINT32_(5) 
#define PINMUX_PA24F_TC5_WO0                       ((PIN_PA24F_TC5_WO0 << 16) | MUX_PA24F_TC5_WO0)
#define PORT_PA24F_TC5_WO0                         (_UINT32_(1) << 24)

#define PIN_PB10F_TC5_WO0                          _UINT32_(42)
#define MUX_PB10F_TC5_WO0                          _UINT32_(5) 
#define PINMUX_PB10F_TC5_WO0                       ((PIN_PB10F_TC5_WO0 << 16) | MUX_PB10F_TC5_WO0)
#define PORT_PB10F_TC5_WO0                         (_UINT32_(1) << 10)

#define PIN_PB14E_TC5_WO0                          _UINT32_(46)
#define MUX_PB14E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PB14E_TC5_WO0                       ((PIN_PB14E_TC5_WO0 << 16) | MUX_PB14E_TC5_WO0)
#define PORT_PB14E_TC5_WO0                         (_UINT32_(1) << 14)

#define PIN_PA25F_TC5_WO1                          _UINT32_(25)
#define MUX_PA25F_TC5_WO1                          _UINT32_(5) 
#define PINMUX_PA25F_TC5_WO1                       ((PIN_PA25F_TC5_WO1 << 16) | MUX_PA25F_TC5_WO1)
#define PORT_PA25F_TC5_WO1                         (_UINT32_(1) << 25)

#define PIN_PB11F_TC5_WO1                          _UINT32_(43)
#define MUX_PB11F_TC5_WO1                          _UINT32_(5) 
#define PINMUX_PB11F_TC5_WO1                       ((PIN_PB11F_TC5_WO1 << 16) | MUX_PB11F_TC5_WO1)
#define PORT_PB11F_TC5_WO1                         (_UINT32_(1) << 11)

#define PIN_PB15E_TC5_WO1                          _UINT32_(47)
#define MUX_PB15E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PB15E_TC5_WO1                       ((PIN_PB15E_TC5_WO1 << 16) | MUX_PB15E_TC5_WO1)
#define PORT_PB15E_TC5_WO1                         (_UINT32_(1) << 15)

/* =================== PORT definition for TC6 peripheral =================== */
#define PIN_PB02F_TC6_WO0                          _UINT32_(34)
#define MUX_PB02F_TC6_WO0                          _UINT32_(5) 
#define PINMUX_PB02F_TC6_WO0                       ((PIN_PB02F_TC6_WO0 << 16) | MUX_PB02F_TC6_WO0)
#define PORT_PB02F_TC6_WO0                         (_UINT32_(1) << 2)

#define PIN_PB16E_TC6_WO0                          _UINT32_(48)
#define MUX_PB16E_TC6_WO0                          _UINT32_(4) 
#define PINMUX_PB16E_TC6_WO0                       ((PIN_PB16E_TC6_WO0 << 16) | MUX_PB16E_TC6_WO0)
#define PORT_PB16E_TC6_WO0                         (_UINT32_(1) << 16)

#define PIN_PB03F_TC6_WO1                          _UINT32_(35)
#define MUX_PB03F_TC6_WO1                          _UINT32_(5) 
#define PINMUX_PB03F_TC6_WO1                       ((PIN_PB03F_TC6_WO1 << 16) | MUX_PB03F_TC6_WO1)
#define PORT_PB03F_TC6_WO1                         (_UINT32_(1) << 3)

#define PIN_PB17E_TC6_WO1                          _UINT32_(49)
#define MUX_PB17E_TC6_WO1                          _UINT32_(4) 
#define PINMUX_PB17E_TC6_WO1                       ((PIN_PB17E_TC6_WO1 << 16) | MUX_PB17E_TC6_WO1)
#define PORT_PB17E_TC6_WO1                         (_UINT32_(1) << 17)

/* =================== PORT definition for TC7 peripheral =================== */
#define PIN_PB00F_TC7_WO0                          _UINT32_(32)
#define MUX_PB00F_TC7_WO0                          _UINT32_(5) 
#define PINMUX_PB00F_TC7_WO0                       ((PIN_PB00F_TC7_WO0 << 16) | MUX_PB00F_TC7_WO0)
#define PORT_PB00F_TC7_WO0                         (_UINT32_(1) << 0)

#define PIN_PB22F_TC7_WO0                          _UINT32_(54)
#define MUX_PB22F_TC7_WO0                          _UINT32_(5) 
#define PINMUX_PB22F_TC7_WO0                       ((PIN_PB22F_TC7_WO0 << 16) | MUX_PB22F_TC7_WO0)
#define PORT_PB22F_TC7_WO0                         (_UINT32_(1) << 22)

#define PIN_PA20E_TC7_WO0                          _UINT32_(20)
#define MUX_PA20E_TC7_WO0                          _UINT32_(4) 
#define PINMUX_PA20E_TC7_WO0                       ((PIN_PA20E_TC7_WO0 << 16) | MUX_PA20E_TC7_WO0)
#define PORT_PA20E_TC7_WO0                         (_UINT32_(1) << 20)

#define PIN_PB01F_TC7_WO1                          _UINT32_(33)
#define MUX_PB01F_TC7_WO1                          _UINT32_(5) 
#define PINMUX_PB01F_TC7_WO1                       ((PIN_PB01F_TC7_WO1 << 16) | MUX_PB01F_TC7_WO1)
#define PORT_PB01F_TC7_WO1                         (_UINT32_(1) << 1)

#define PIN_PB23F_TC7_WO1                          _UINT32_(55)
#define MUX_PB23F_TC7_WO1                          _UINT32_(5) 
#define PINMUX_PB23F_TC7_WO1                       ((PIN_PB23F_TC7_WO1 << 16) | MUX_PB23F_TC7_WO1)
#define PORT_PB23F_TC7_WO1                         (_UINT32_(1) << 23)

#define PIN_PA21E_TC7_WO1                          _UINT32_(21)
#define MUX_PA21E_TC7_WO1                          _UINT32_(4) 
#define PINMUX_PA21E_TC7_WO1                       ((PIN_PA21E_TC7_WO1 << 16) | MUX_PA21E_TC7_WO1)
#define PORT_PA21E_TC7_WO1                         (_UINT32_(1) << 21)



#endif /* _PIC32CM3204GV00064_GPIO_H_ */

